GopalSaraf/Practicals/PSDL/include/proc/pic16f1618.inc
// Register: CRCDATH
#define CRCDATH CRCDATH
CRCDATH                                  equ 0792h
// bitfield definitions
CRCDATH_DAT_POSN                         equ 0000h
CRCDATH_DAT_POSITION                     equ 0000h
CRCDATH_DAT_SIZE                         equ 0008h
CRCDATH_DAT_LENGTH                       equ 0008h
CRCDATH_DAT_MASK                         equ 00FFh
CRCDATH_DAT8_POSN                        equ 0000h
CRCDATH_DAT8_POSITION                    equ 0000h
CRCDATH_DAT8_SIZE                        equ 0001h
CRCDATH_DAT8_LENGTH                      equ 0001h
CRCDATH_DAT8_MASK                        equ 0001h
CRCDATH_DAT9_POSN                        equ 0001h
CRCDATH_DAT9_POSITION                    equ 0001h
CRCDATH_DAT9_SIZE                        equ 0001h
CRCDATH_DAT9_LENGTH                      equ 0001h
CRCDATH_DAT9_MASK                        equ 0002h
CRCDATH_DAT10_POSN                       equ 0002h
CRCDATH_DAT10_POSITION                   equ 0002h
CRCDATH_DAT10_SIZE                       equ 0001h
CRCDATH_DAT10_LENGTH                     equ 0001h
CRCDATH_DAT10_MASK                       equ 0004h
CRCDATH_DAT11_POSN                       equ 0003h
CRCDATH_DAT11_POSITION                   equ 0003h
CRCDATH_DAT11_SIZE                       equ 0001h
CRCDATH_DAT11_LENGTH                     equ 0001h
CRCDATH_DAT11_MASK                       equ 0008h
CRCDATH_DAT12_POSN                       equ 0004h
CRCDATH_DAT12_POSITION                   equ 0004h
CRCDATH_DAT12_SIZE                       equ 0001h
CRCDATH_DAT12_LENGTH                     equ 0001h
CRCDATH_DAT12_MASK                       equ 0010h
CRCDATH_DAT13_POSN                       equ 0005h
CRCDATH_DAT13_POSITION                   equ 0005h
CRCDATH_DAT13_SIZE                       equ 0001h
CRCDATH_DAT13_LENGTH                     equ 0001h
CRCDATH_DAT13_MASK                       equ 0020h
CRCDATH_DAT14_POSN                       equ 0006h
CRCDATH_DAT14_POSITION                   equ 0006h
CRCDATH_DAT14_SIZE                       equ 0001h
CRCDATH_DAT14_LENGTH                     equ 0001h
CRCDATH_DAT14_MASK                       equ 0040h
CRCDATH_DAT15_POSN                       equ 0007h
CRCDATH_DAT15_POSITION                   equ 0007h
CRCDATH_DAT15_SIZE                       equ 0001h
CRCDATH_DAT15_LENGTH                     equ 0001h
CRCDATH_DAT15_MASK                       equ 0080h
CRCDATH_CRCDAT_POSN                      equ 0000h
CRCDATH_CRCDAT_POSITION                  equ 0000h
CRCDATH_CRCDAT_SIZE                      equ 0008h
CRCDATH_CRCDAT_LENGTH                    equ 0008h
CRCDATH_CRCDAT_MASK                      equ 00FFh
CRCDATH_CRCDAT8_POSN                     equ 0000h
CRCDATH_CRCDAT8_POSITION                 equ 0000h
CRCDATH_CRCDAT8_SIZE                     equ 0001h
CRCDATH_CRCDAT8_LENGTH                   equ 0001h
CRCDATH_CRCDAT8_MASK                     equ 0001h
CRCDATH_CRCDAT9_POSN                     equ 0001h
CRCDATH_CRCDAT9_POSITION                 equ 0001h
CRCDATH_CRCDAT9_SIZE                     equ 0001h
CRCDATH_CRCDAT9_LENGTH                   equ 0001h
CRCDATH_CRCDAT9_MASK                     equ 0002h
CRCDATH_CRCDAT10_POSN                    equ 0002h
CRCDATH_CRCDAT10_POSITION                equ 0002h
CRCDATH_CRCDAT10_SIZE                    equ 0001h
CRCDATH_CRCDAT10_LENGTH                  equ 0001h
CRCDATH_CRCDAT10_MASK                    equ 0004h
CRCDATH_CRCDAT11_POSN                    equ 0003h
CRCDATH_CRCDAT11_POSITION                equ 0003h
CRCDATH_CRCDAT11_SIZE                    equ 0001h
CRCDATH_CRCDAT11_LENGTH                  equ 0001h
CRCDATH_CRCDAT11_MASK                    equ 0008h
CRCDATH_CRCDAT12_POSN                    equ 0004h
CRCDATH_CRCDAT12_POSITION                equ 0004h
CRCDATH_CRCDAT12_SIZE                    equ 0001h
CRCDATH_CRCDAT12_LENGTH                  equ 0001h
CRCDATH_CRCDAT12_MASK                    equ 0010h
CRCDATH_CRCDAT13_POSN                    equ 0005h
CRCDATH_CRCDAT13_POSITION                equ 0005h
CRCDATH_CRCDAT13_SIZE                    equ 0001h
CRCDATH_CRCDAT13_LENGTH                  equ 0001h
CRCDATH_CRCDAT13_MASK                    equ 0020h
CRCDATH_CRCDAT14_POSN                    equ 0006h
CRCDATH_CRCDAT14_POSITION                equ 0006h
CRCDATH_CRCDAT14_SIZE                    equ 0001h
CRCDATH_CRCDAT14_LENGTH                  equ 0001h
CRCDATH_CRCDAT14_MASK                    equ 0040h
CRCDATH_CRCDAT15_POSN                    equ 0007h
CRCDATH_CRCDAT15_POSITION                equ 0007h
CRCDATH_CRCDAT15_SIZE                    equ 0001h
CRCDATH_CRCDAT15_LENGTH                  equ 0001h
CRCDATH_CRCDAT15_MASK                    equ 0080h

// Register: CRCACCL
#define CRCACCL CRCACCL
CRCACCL                                  equ 0793h
// bitfield definitions
CRCACCL_ACC_POSN                         equ 0000h
CRCACCL_ACC_POSITION                     equ 0000h
CRCACCL_ACC_SIZE                         equ 0008h
CRCACCL_ACC_LENGTH                       equ 0008h
CRCACCL_ACC_MASK                         equ 00FFh
CRCACCL_ACC0_POSN                        equ 0000h
CRCACCL_ACC0_POSITION                    equ 0000h
CRCACCL_ACC0_SIZE                        equ 0001h
CRCACCL_ACC0_LENGTH                      equ 0001h
CRCACCL_ACC0_MASK                        equ 0001h
CRCACCL_ACC1_POSN                        equ 0001h
CRCACCL_ACC1_POSITION                    equ 0001h
CRCACCL_ACC1_SIZE                        equ 0001h
CRCACCL_ACC1_LENGTH                      equ 0001h
CRCACCL_ACC1_MASK                        equ 0002h
CRCACCL_ACC2_POSN                        equ 0002h
CRCACCL_ACC2_POSITION                    equ 0002h
CRCACCL_ACC2_SIZE                        equ 0001h
CRCACCL_ACC2_LENGTH                      equ 0001h
CRCACCL_ACC2_MASK                        equ 0004h
CRCACCL_ACC3_POSN                        equ 0003h
CRCACCL_ACC3_POSITION                    equ 0003h
CRCACCL_ACC3_SIZE                        equ 0001h
CRCACCL_ACC3_LENGTH                      equ 0001h
CRCACCL_ACC3_MASK                        equ 0008h
CRCACCL_ACC4_POSN                        equ 0004h
CRCACCL_ACC4_POSITION                    equ 0004h
CRCACCL_ACC4_SIZE                        equ 0001h
CRCACCL_ACC4_LENGTH                      equ 0001h
CRCACCL_ACC4_MASK                        equ 0010h
CRCACCL_ACC5_POSN                        equ 0005h
CRCACCL_ACC5_POSITION                    equ 0005h
CRCACCL_ACC5_SIZE                        equ 0001h
CRCACCL_ACC5_LENGTH                      equ 0001h
CRCACCL_ACC5_MASK                        equ 0020h
CRCACCL_ACC6_POSN                        equ 0006h
CRCACCL_ACC6_POSITION                    equ 0006h
CRCACCL_ACC6_SIZE                        equ 0001h
CRCACCL_ACC6_LENGTH                      equ 0001h
CRCACCL_ACC6_MASK                        equ 0040h
CRCACCL_ACC7_POSN                        equ 0007h
CRCACCL_ACC7_POSITION                    equ 0007h
CRCACCL_ACC7_SIZE                        equ 0001h
CRCACCL_ACC7_LENGTH                      equ 0001h
CRCACCL_ACC7_MASK                        equ 0080h
CRCACCL_CRCACC_POSN                      equ 0000h
CRCACCL_CRCACC_POSITION                  equ 0000h
CRCACCL_CRCACC_SIZE                      equ 0008h
CRCACCL_CRCACC_LENGTH                    equ 0008h
CRCACCL_CRCACC_MASK                      equ 00FFh
CRCACCL_CRCACC0_POSN                     equ 0000h
CRCACCL_CRCACC0_POSITION                 equ 0000h
CRCACCL_CRCACC0_SIZE                     equ 0001h
CRCACCL_CRCACC0_LENGTH                   equ 0001h
CRCACCL_CRCACC0_MASK                     equ 0001h
CRCACCL_CRCACC1_POSN                     equ 0001h
CRCACCL_CRCACC1_POSITION                 equ 0001h
CRCACCL_CRCACC1_SIZE                     equ 0001h
CRCACCL_CRCACC1_LENGTH                   equ 0001h
CRCACCL_CRCACC1_MASK                     equ 0002h
CRCACCL_CRCACC2_POSN                     equ 0002h
CRCACCL_CRCACC2_POSITION                 equ 0002h
CRCACCL_CRCACC2_SIZE                     equ 0001h
CRCACCL_CRCACC2_LENGTH                   equ 0001h
CRCACCL_CRCACC2_MASK                     equ 0004h
CRCACCL_CRCACC3_POSN                     equ 0003h
CRCACCL_CRCACC3_POSITION                 equ 0003h
CRCACCL_CRCACC3_SIZE                     equ 0001h
CRCACCL_CRCACC3_LENGTH                   equ 0001h
CRCACCL_CRCACC3_MASK                     equ 0008h
CRCACCL_CRCACC4_POSN                     equ 0004h
CRCACCL_CRCACC4_POSITION                 equ 0004h
CRCACCL_CRCACC4_SIZE                     equ 0001h
CRCACCL_CRCACC4_LENGTH                   equ 0001h
CRCACCL_CRCACC4_MASK                     equ 0010h
CRCACCL_CRCACC5_POSN                     equ 0005h
CRCACCL_CRCACC5_POSITION                 equ 0005h
CRCACCL_CRCACC5_SIZE                     equ 0001h
CRCACCL_CRCACC5_LENGTH                   equ 0001h
CRCACCL_CRCACC5_MASK                     equ 0020h
CRCACCL_CRCACC6_POSN                     equ 0006h
CRCACCL_CRCACC6_POSITION                 equ 0006h
CRCACCL_CRCACC6_SIZE                     equ 0001h
CRCACCL_CRCACC6_LENGTH                   equ 0001h
CRCACCL_CRCACC6_MASK                     equ 0040h
CRCACCL_CRCACC7_POSN                     equ 0007h
CRCACCL_CRCACC7_POSITION                 equ 0007h
CRCACCL_CRCACC7_SIZE                     equ 0001h
CRCACCL_CRCACC7_LENGTH                   equ 0001h
CRCACCL_CRCACC7_MASK                     equ 0080h

// Register: CRCACCH
#define CRCACCH CRCACCH
CRCACCH                                  equ 0794h
// bitfield definitions
CRCACCH_ACC_POSN                         equ 0000h
CRCACCH_ACC_POSITION                     equ 0000h
CRCACCH_ACC_SIZE                         equ 0008h
CRCACCH_ACC_LENGTH                       equ 0008h
CRCACCH_ACC_MASK                         equ 00FFh
CRCACCH_ACC8_POSN                        equ 0000h
CRCACCH_ACC8_POSITION                    equ 0000h
CRCACCH_ACC8_SIZE                        equ 0001h
CRCACCH_ACC8_LENGTH                      equ 0001h
CRCACCH_ACC8_MASK                        equ 0001h
CRCACCH_ACC9_POSN                        equ 0001h
CRCACCH_ACC9_POSITION                    equ 0001h
CRCACCH_ACC9_SIZE                        equ 0001h
CRCACCH_ACC9_LENGTH                      equ 0001h
CRCACCH_ACC9_MASK                        equ 0002h
CRCACCH_ACC10_POSN                       equ 0002h
CRCACCH_ACC10_POSITION                   equ 0002h
CRCACCH_ACC10_SIZE                       equ 0001h
CRCACCH_ACC10_LENGTH                     equ 0001h
CRCACCH_ACC10_MASK                       equ 0004h
CRCACCH_ACC11_POSN                       equ 0003h
CRCACCH_ACC11_POSITION                   equ 0003h
CRCACCH_ACC11_SIZE                       equ 0001h
CRCACCH_ACC11_LENGTH                     equ 0001h
CRCACCH_ACC11_MASK                       equ 0008h
CRCACCH_ACC12_POSN                       equ 0004h
CRCACCH_ACC12_POSITION                   equ 0004h
CRCACCH_ACC12_SIZE                       equ 0001h
CRCACCH_ACC12_LENGTH                     equ 0001h
CRCACCH_ACC12_MASK                       equ 0010h
CRCACCH_ACC13_POSN                       equ 0005h
CRCACCH_ACC13_POSITION                   equ 0005h
CRCACCH_ACC13_SIZE                       equ 0001h
CRCACCH_ACC13_LENGTH                     equ 0001h
CRCACCH_ACC13_MASK                       equ 0020h
CRCACCH_ACC14_POSN                       equ 0006h
CRCACCH_ACC14_POSITION                   equ 0006h
CRCACCH_ACC14_SIZE                       equ 0001h
CRCACCH_ACC14_LENGTH                     equ 0001h
CRCACCH_ACC14_MASK                       equ 0040h
CRCACCH_ACC15_POSN                       equ 0007h
CRCACCH_ACC15_POSITION                   equ 0007h
CRCACCH_ACC15_SIZE                       equ 0001h
CRCACCH_ACC15_LENGTH                     equ 0001h
CRCACCH_ACC15_MASK                       equ 0080h
CRCACCH_CRCACC_POSN                      equ 0000h
CRCACCH_CRCACC_POSITION                  equ 0000h
CRCACCH_CRCACC_SIZE                      equ 0008h
CRCACCH_CRCACC_LENGTH                    equ 0008h
CRCACCH_CRCACC_MASK                      equ 00FFh
CRCACCH_CRCACC8_POSN                     equ 0000h
CRCACCH_CRCACC8_POSITION                 equ 0000h
CRCACCH_CRCACC8_SIZE                     equ 0001h
CRCACCH_CRCACC8_LENGTH                   equ 0001h
CRCACCH_CRCACC8_MASK                     equ 0001h
CRCACCH_CRCACC9_POSN                     equ 0001h
CRCACCH_CRCACC9_POSITION                 equ 0001h
CRCACCH_CRCACC9_SIZE                     equ 0001h
CRCACCH_CRCACC9_LENGTH                   equ 0001h
CRCACCH_CRCACC9_MASK                     equ 0002h
CRCACCH_CRCACC10_POSN                    equ 0002h
CRCACCH_CRCACC10_POSITION                equ 0002h
CRCACCH_CRCACC10_SIZE                    equ 0001h
CRCACCH_CRCACC10_LENGTH                  equ 0001h
CRCACCH_CRCACC10_MASK                    equ 0004h
CRCACCH_CRCACC11_POSN                    equ 0003h
CRCACCH_CRCACC11_POSITION                equ 0003h
CRCACCH_CRCACC11_SIZE                    equ 0001h
CRCACCH_CRCACC11_LENGTH                  equ 0001h
CRCACCH_CRCACC11_MASK                    equ 0008h
CRCACCH_CRCACC12_POSN                    equ 0004h
CRCACCH_CRCACC12_POSITION                equ 0004h
CRCACCH_CRCACC12_SIZE                    equ 0001h
CRCACCH_CRCACC12_LENGTH                  equ 0001h
CRCACCH_CRCACC12_MASK                    equ 0010h
CRCACCH_CRCACC13_POSN                    equ 0005h
CRCACCH_CRCACC13_POSITION                equ 0005h
CRCACCH_CRCACC13_SIZE                    equ 0001h
CRCACCH_CRCACC13_LENGTH                  equ 0001h
CRCACCH_CRCACC13_MASK                    equ 0020h
CRCACCH_CRCACC14_POSN                    equ 0006h
CRCACCH_CRCACC14_POSITION                equ 0006h
CRCACCH_CRCACC14_SIZE                    equ 0001h
CRCACCH_CRCACC14_LENGTH                  equ 0001h
CRCACCH_CRCACC14_MASK                    equ 0040h
CRCACCH_CRCACC15_POSN                    equ 0007h
CRCACCH_CRCACC15_POSITION                equ 0007h
CRCACCH_CRCACC15_SIZE                    equ 0001h
CRCACCH_CRCACC15_LENGTH                  equ 0001h
CRCACCH_CRCACC15_MASK                    equ 0080h

// Register: CRCSHIFTL
#define CRCSHIFTL CRCSHIFTL
CRCSHIFTL                                equ 0795h
// bitfield definitions
CRCSHIFTL_SHIFT_POSN                     equ 0000h
CRCSHIFTL_SHIFT_POSITION                 equ 0000h
CRCSHIFTL_SHIFT_SIZE                     equ 0008h
CRCSHIFTL_SHIFT_LENGTH                   equ 0008h
CRCSHIFTL_SHIFT_MASK                     equ 00FFh
CRCSHIFTL_SHIFT0_POSN                    equ 0000h
CRCSHIFTL_SHIFT0_POSITION                equ 0000h
CRCSHIFTL_SHIFT0_SIZE                    equ 0001h
CRCSHIFTL_SHIFT0_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT0_MASK                    equ 0001h
CRCSHIFTL_SHIFT1_POSN                    equ 0001h
CRCSHIFTL_SHIFT1_POSITION                equ 0001h
CRCSHIFTL_SHIFT1_SIZE                    equ 0001h
CRCSHIFTL_SHIFT1_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT1_MASK                    equ 0002h
CRCSHIFTL_SHIFT2_POSN                    equ 0002h
CRCSHIFTL_SHIFT2_POSITION                equ 0002h
CRCSHIFTL_SHIFT2_SIZE                    equ 0001h
CRCSHIFTL_SHIFT2_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT2_MASK                    equ 0004h
CRCSHIFTL_SHIFT3_POSN                    equ 0003h
CRCSHIFTL_SHIFT3_POSITION                equ 0003h
CRCSHIFTL_SHIFT3_SIZE                    equ 0001h
CRCSHIFTL_SHIFT3_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT3_MASK                    equ 0008h
CRCSHIFTL_SHIFT4_POSN                    equ 0004h
CRCSHIFTL_SHIFT4_POSITION                equ 0004h
CRCSHIFTL_SHIFT4_SIZE                    equ 0001h
CRCSHIFTL_SHIFT4_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT4_MASK                    equ 0010h
CRCSHIFTL_SHIFT5_POSN                    equ 0005h
CRCSHIFTL_SHIFT5_POSITION                equ 0005h
CRCSHIFTL_SHIFT5_SIZE                    equ 0001h
CRCSHIFTL_SHIFT5_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT5_MASK                    equ 0020h
CRCSHIFTL_SHIFT6_POSN                    equ 0006h
CRCSHIFTL_SHIFT6_POSITION                equ 0006h
CRCSHIFTL_SHIFT6_SIZE                    equ 0001h
CRCSHIFTL_SHIFT6_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT6_MASK                    equ 0040h
CRCSHIFTL_SHIFT7_POSN                    equ 0007h
CRCSHIFTL_SHIFT7_POSITION                equ 0007h
CRCSHIFTL_SHIFT7_SIZE                    equ 0001h
CRCSHIFTL_SHIFT7_LENGTH                  equ 0001h
CRCSHIFTL_SHIFT7_MASK                    equ 0080h
CRCSHIFTL_CRCSHIFT_POSN                  equ 0000h
CRCSHIFTL_CRCSHIFT_POSITION              equ 0000h
CRCSHIFTL_CRCSHIFT_SIZE                  equ 0008h
CRCSHIFTL_CRCSHIFT_LENGTH                equ 0008h
CRCSHIFTL_CRCSHIFT_MASK                  equ 00FFh
CRCSHIFTL_CRCSHIFT0_POSN                 equ 0000h
CRCSHIFTL_CRCSHIFT0_POSITION             equ 0000h
CRCSHIFTL_CRCSHIFT0_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT0_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT0_MASK                 equ 0001h
CRCSHIFTL_CRCSHIFT1_POSN                 equ 0001h
CRCSHIFTL_CRCSHIFT1_POSITION             equ 0001h
CRCSHIFTL_CRCSHIFT1_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT1_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT1_MASK                 equ 0002h
CRCSHIFTL_CRCSHIFT2_POSN                 equ 0002h
CRCSHIFTL_CRCSHIFT2_POSITION             equ 0002h
CRCSHIFTL_CRCSHIFT2_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT2_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT2_MASK                 equ 0004h
CRCSHIFTL_CRCSHIFT3_POSN                 equ 0003h
CRCSHIFTL_CRCSHIFT3_POSITION             equ 0003h
CRCSHIFTL_CRCSHIFT3_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT3_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT3_MASK                 equ 0008h
CRCSHIFTL_CRCSHIFT4_POSN                 equ 0004h
CRCSHIFTL_CRCSHIFT4_POSITION             equ 0004h
CRCSHIFTL_CRCSHIFT4_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT4_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT4_MASK                 equ 0010h
CRCSHIFTL_CRCSHIFT5_POSN                 equ 0005h
CRCSHIFTL_CRCSHIFT5_POSITION             equ 0005h
CRCSHIFTL_CRCSHIFT5_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT5_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT5_MASK                 equ 0020h
CRCSHIFTL_CRCSHIFT6_POSN                 equ 0006h
CRCSHIFTL_CRCSHIFT6_POSITION             equ 0006h
CRCSHIFTL_CRCSHIFT6_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT6_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT6_MASK                 equ 0040h
CRCSHIFTL_CRCSHIFT7_POSN                 equ 0007h
CRCSHIFTL_CRCSHIFT7_POSITION             equ 0007h
CRCSHIFTL_CRCSHIFT7_SIZE                 equ 0001h
CRCSHIFTL_CRCSHIFT7_LENGTH               equ 0001h
CRCSHIFTL_CRCSHIFT7_MASK                 equ 0080h

