GopalSaraf/Practicals/PSDL/include/proc/pic16f1618.inc
// Register: SMT2CON1
#define SMT2CON1 SMT2CON1
SMT2CON1                                 equ 0DABh
// bitfield definitions
SMT2CON1_MODE_POSN                       equ 0000h
SMT2CON1_MODE_POSITION                   equ 0000h
SMT2CON1_MODE_SIZE                       equ 0004h
SMT2CON1_MODE_LENGTH                     equ 0004h
SMT2CON1_MODE_MASK                       equ 000Fh
SMT2CON1_REPEAT_POSN                     equ 0006h
SMT2CON1_REPEAT_POSITION                 equ 0006h
SMT2CON1_REPEAT_SIZE                     equ 0001h
SMT2CON1_REPEAT_LENGTH                   equ 0001h
SMT2CON1_REPEAT_MASK                     equ 0040h
SMT2CON1_SMT2GO_POSN                     equ 0007h
SMT2CON1_SMT2GO_POSITION                 equ 0007h
SMT2CON1_SMT2GO_SIZE                     equ 0001h
SMT2CON1_SMT2GO_LENGTH                   equ 0001h
SMT2CON1_SMT2GO_MASK                     equ 0080h
SMT2CON1_MODE0_POSN                      equ 0000h
SMT2CON1_MODE0_POSITION                  equ 0000h
SMT2CON1_MODE0_SIZE                      equ 0001h
SMT2CON1_MODE0_LENGTH                    equ 0001h
SMT2CON1_MODE0_MASK                      equ 0001h
SMT2CON1_MODE1_POSN                      equ 0001h
SMT2CON1_MODE1_POSITION                  equ 0001h
SMT2CON1_MODE1_SIZE                      equ 0001h
SMT2CON1_MODE1_LENGTH                    equ 0001h
SMT2CON1_MODE1_MASK                      equ 0002h
SMT2CON1_MODE2_POSN                      equ 0002h
SMT2CON1_MODE2_POSITION                  equ 0002h
SMT2CON1_MODE2_SIZE                      equ 0001h
SMT2CON1_MODE2_LENGTH                    equ 0001h
SMT2CON1_MODE2_MASK                      equ 0004h
SMT2CON1_MODE3_POSN                      equ 0003h
SMT2CON1_MODE3_POSITION                  equ 0003h
SMT2CON1_MODE3_SIZE                      equ 0001h
SMT2CON1_MODE3_LENGTH                    equ 0001h
SMT2CON1_MODE3_MASK                      equ 0008h
SMT2CON1_SMT2MODE_POSN                   equ 0000h
SMT2CON1_SMT2MODE_POSITION               equ 0000h
SMT2CON1_SMT2MODE_SIZE                   equ 0004h
SMT2CON1_SMT2MODE_LENGTH                 equ 0004h
SMT2CON1_SMT2MODE_MASK                   equ 000Fh
SMT2CON1_SMT2REPEAT_POSN                 equ 0006h
SMT2CON1_SMT2REPEAT_POSITION             equ 0006h
SMT2CON1_SMT2REPEAT_SIZE                 equ 0001h
SMT2CON1_SMT2REPEAT_LENGTH               equ 0001h
SMT2CON1_SMT2REPEAT_MASK                 equ 0040h
SMT2CON1_SMT2MODE0_POSN                  equ 0000h
SMT2CON1_SMT2MODE0_POSITION              equ 0000h
SMT2CON1_SMT2MODE0_SIZE                  equ 0001h
SMT2CON1_SMT2MODE0_LENGTH                equ 0001h
SMT2CON1_SMT2MODE0_MASK                  equ 0001h
SMT2CON1_SMT2MODE1_POSN                  equ 0001h
SMT2CON1_SMT2MODE1_POSITION              equ 0001h
SMT2CON1_SMT2MODE1_SIZE                  equ 0001h
SMT2CON1_SMT2MODE1_LENGTH                equ 0001h
SMT2CON1_SMT2MODE1_MASK                  equ 0002h
SMT2CON1_SMT2MODE2_POSN                  equ 0002h
SMT2CON1_SMT2MODE2_POSITION              equ 0002h
SMT2CON1_SMT2MODE2_SIZE                  equ 0001h
SMT2CON1_SMT2MODE2_LENGTH                equ 0001h
SMT2CON1_SMT2MODE2_MASK                  equ 0004h
SMT2CON1_SMT2MODE3_POSN                  equ 0003h
SMT2CON1_SMT2MODE3_POSITION              equ 0003h
SMT2CON1_SMT2MODE3_SIZE                  equ 0001h
SMT2CON1_SMT2MODE3_LENGTH                equ 0001h
SMT2CON1_SMT2MODE3_MASK                  equ 0008h

// Register: SMT2STAT
#define SMT2STAT SMT2STAT
SMT2STAT                                 equ 0DACh
// bitfield definitions
SMT2STAT_AS_POSN                         equ 0000h
SMT2STAT_AS_POSITION                     equ 0000h
SMT2STAT_AS_SIZE                         equ 0001h
SMT2STAT_AS_LENGTH                       equ 0001h
SMT2STAT_AS_MASK                         equ 0001h
SMT2STAT_WS_POSN                         equ 0001h
SMT2STAT_WS_POSITION                     equ 0001h
SMT2STAT_WS_SIZE                         equ 0001h
SMT2STAT_WS_LENGTH                       equ 0001h
SMT2STAT_WS_MASK                         equ 0002h
SMT2STAT_TS_POSN                         equ 0002h
SMT2STAT_TS_POSITION                     equ 0002h
SMT2STAT_TS_SIZE                         equ 0001h
SMT2STAT_TS_LENGTH                       equ 0001h
SMT2STAT_TS_MASK                         equ 0004h
SMT2STAT_RST_POSN                        equ 0005h
SMT2STAT_RST_POSITION                    equ 0005h
SMT2STAT_RST_SIZE                        equ 0001h
SMT2STAT_RST_LENGTH                      equ 0001h
SMT2STAT_RST_MASK                        equ 0020h
SMT2STAT_CPWUP_POSN                      equ 0006h
SMT2STAT_CPWUP_POSITION                  equ 0006h
SMT2STAT_CPWUP_SIZE                      equ 0001h
SMT2STAT_CPWUP_LENGTH                    equ 0001h
SMT2STAT_CPWUP_MASK                      equ 0040h
SMT2STAT_CPRUP_POSN                      equ 0007h
SMT2STAT_CPRUP_POSITION                  equ 0007h
SMT2STAT_CPRUP_SIZE                      equ 0001h
SMT2STAT_CPRUP_LENGTH                    equ 0001h
SMT2STAT_CPRUP_MASK                      equ 0080h
SMT2STAT_SMT2AS_POSN                     equ 0000h
SMT2STAT_SMT2AS_POSITION                 equ 0000h
SMT2STAT_SMT2AS_SIZE                     equ 0001h
SMT2STAT_SMT2AS_LENGTH                   equ 0001h
SMT2STAT_SMT2AS_MASK                     equ 0001h
SMT2STAT_SMT2WS_POSN                     equ 0001h
SMT2STAT_SMT2WS_POSITION                 equ 0001h
SMT2STAT_SMT2WS_SIZE                     equ 0001h
SMT2STAT_SMT2WS_LENGTH                   equ 0001h
SMT2STAT_SMT2WS_MASK                     equ 0002h
SMT2STAT_SMT2TS_POSN                     equ 0002h
SMT2STAT_SMT2TS_POSITION                 equ 0002h
SMT2STAT_SMT2TS_SIZE                     equ 0001h
SMT2STAT_SMT2TS_LENGTH                   equ 0001h
SMT2STAT_SMT2TS_MASK                     equ 0004h
SMT2STAT_SMT2RESET_POSN                  equ 0005h
SMT2STAT_SMT2RESET_POSITION              equ 0005h
SMT2STAT_SMT2RESET_SIZE                  equ 0001h
SMT2STAT_SMT2RESET_LENGTH                equ 0001h
SMT2STAT_SMT2RESET_MASK                  equ 0020h
SMT2STAT_SMT2CPWUP_POSN                  equ 0006h
SMT2STAT_SMT2CPWUP_POSITION              equ 0006h
SMT2STAT_SMT2CPWUP_SIZE                  equ 0001h
SMT2STAT_SMT2CPWUP_LENGTH                equ 0001h
SMT2STAT_SMT2CPWUP_MASK                  equ 0040h
SMT2STAT_SMT2CPRUP_POSN                  equ 0007h
SMT2STAT_SMT2CPRUP_POSITION              equ 0007h
SMT2STAT_SMT2CPRUP_SIZE                  equ 0001h
SMT2STAT_SMT2CPRUP_LENGTH                equ 0001h
SMT2STAT_SMT2CPRUP_MASK                  equ 0080h

// Register: SMT2CLK
#define SMT2CLK SMT2CLK
SMT2CLK                                  equ 0DADh
// bitfield definitions
SMT2CLK_CSEL_POSN                        equ 0000h
SMT2CLK_CSEL_POSITION                    equ 0000h
SMT2CLK_CSEL_SIZE                        equ 0008h
SMT2CLK_CSEL_LENGTH                      equ 0008h
SMT2CLK_CSEL_MASK                        equ 00FFh
SMT2CLK_CSEL0_POSN                       equ 0000h
SMT2CLK_CSEL0_POSITION                   equ 0000h
SMT2CLK_CSEL0_SIZE                       equ 0001h
SMT2CLK_CSEL0_LENGTH                     equ 0001h
SMT2CLK_CSEL0_MASK                       equ 0001h
SMT2CLK_CSEL1_POSN                       equ 0001h
SMT2CLK_CSEL1_POSITION                   equ 0001h
SMT2CLK_CSEL1_SIZE                       equ 0001h
SMT2CLK_CSEL1_LENGTH                     equ 0001h
SMT2CLK_CSEL1_MASK                       equ 0002h
SMT2CLK_CSEL2_POSN                       equ 0002h
SMT2CLK_CSEL2_POSITION                   equ 0002h
SMT2CLK_CSEL2_SIZE                       equ 0001h
SMT2CLK_CSEL2_LENGTH                     equ 0001h
SMT2CLK_CSEL2_MASK                       equ 0004h
SMT2CLK_SMT2CSEL_POSN                    equ 0000h
SMT2CLK_SMT2CSEL_POSITION                equ 0000h
SMT2CLK_SMT2CSEL_SIZE                    equ 0008h
SMT2CLK_SMT2CSEL_LENGTH                  equ 0008h
SMT2CLK_SMT2CSEL_MASK                    equ 00FFh
SMT2CLK_SMT2CSEL0_POSN                   equ 0000h
SMT2CLK_SMT2CSEL0_POSITION               equ 0000h
SMT2CLK_SMT2CSEL0_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL0_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL0_MASK                   equ 0001h
SMT2CLK_SMT2CSEL1_POSN                   equ 0001h
SMT2CLK_SMT2CSEL1_POSITION               equ 0001h
SMT2CLK_SMT2CSEL1_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL1_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL1_MASK                   equ 0002h
SMT2CLK_SMT2CSEL2_POSN                   equ 0002h
SMT2CLK_SMT2CSEL2_POSITION               equ 0002h
SMT2CLK_SMT2CSEL2_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL2_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL2_MASK                   equ 0004h

// Register: SMT2SIG
#define SMT2SIG SMT2SIG
SMT2SIG                                  equ 0DAEh
// bitfield definitions
SMT2SIG_SSEL_POSN                        equ 0000h
SMT2SIG_SSEL_POSITION                    equ 0000h
SMT2SIG_SSEL_SIZE                        equ 0008h
SMT2SIG_SSEL_LENGTH                      equ 0008h
SMT2SIG_SSEL_MASK                        equ 00FFh
SMT2SIG_SSEL0_POSN                       equ 0000h
SMT2SIG_SSEL0_POSITION                   equ 0000h
SMT2SIG_SSEL0_SIZE                       equ 0001h
SMT2SIG_SSEL0_LENGTH                     equ 0001h
SMT2SIG_SSEL0_MASK                       equ 0001h
SMT2SIG_SSEL1_POSN                       equ 0001h
SMT2SIG_SSEL1_POSITION                   equ 0001h
SMT2SIG_SSEL1_SIZE                       equ 0001h
SMT2SIG_SSEL1_LENGTH                     equ 0001h
SMT2SIG_SSEL1_MASK                       equ 0002h
SMT2SIG_SSEL2_POSN                       equ 0002h
SMT2SIG_SSEL2_POSITION                   equ 0002h
SMT2SIG_SSEL2_SIZE                       equ 0001h
SMT2SIG_SSEL2_LENGTH                     equ 0001h
SMT2SIG_SSEL2_MASK                       equ 0004h
SMT2SIG_SSEL3_POSN                       equ 0003h
SMT2SIG_SSEL3_POSITION                   equ 0003h
SMT2SIG_SSEL3_SIZE                       equ 0001h
SMT2SIG_SSEL3_LENGTH                     equ 0001h
SMT2SIG_SSEL3_MASK                       equ 0008h
SMT2SIG_SSEL4_POSN                       equ 0004h
SMT2SIG_SSEL4_POSITION                   equ 0004h
SMT2SIG_SSEL4_SIZE                       equ 0001h
SMT2SIG_SSEL4_LENGTH                     equ 0001h
SMT2SIG_SSEL4_MASK                       equ 0010h
SMT2SIG_SMT2SSEL_POSN                    equ 0000h
SMT2SIG_SMT2SSEL_POSITION                equ 0000h
SMT2SIG_SMT2SSEL_SIZE                    equ 0008h
SMT2SIG_SMT2SSEL_LENGTH                  equ 0008h
SMT2SIG_SMT2SSEL_MASK                    equ 00FFh
SMT2SIG_SMT2SSEL0_POSN                   equ 0000h
SMT2SIG_SMT2SSEL0_POSITION               equ 0000h
SMT2SIG_SMT2SSEL0_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL0_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL0_MASK                   equ 0001h
SMT2SIG_SMT2SSEL1_POSN                   equ 0001h
SMT2SIG_SMT2SSEL1_POSITION               equ 0001h
SMT2SIG_SMT2SSEL1_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL1_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL1_MASK                   equ 0002h
SMT2SIG_SMT2SSEL2_POSN                   equ 0002h
SMT2SIG_SMT2SSEL2_POSITION               equ 0002h
SMT2SIG_SMT2SSEL2_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL2_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL2_MASK                   equ 0004h
SMT2SIG_SMT2SSEL3_POSN                   equ 0003h
SMT2SIG_SMT2SSEL3_POSITION               equ 0003h
SMT2SIG_SMT2SSEL3_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL3_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL3_MASK                   equ 0008h
SMT2SIG_SMT2SSEL4_POSN                   equ 0004h
SMT2SIG_SMT2SSEL4_POSITION               equ 0004h
SMT2SIG_SMT2SSEL4_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL4_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL4_MASK                   equ 0010h

// Register: SMT2WIN
#define SMT2WIN SMT2WIN
SMT2WIN                                  equ 0DAFh
// bitfield definitions
SMT2WIN_WSEL_POSN                        equ 0000h
SMT2WIN_WSEL_POSITION                    equ 0000h
SMT2WIN_WSEL_SIZE                        equ 0008h
SMT2WIN_WSEL_LENGTH                      equ 0008h
SMT2WIN_WSEL_MASK                        equ 00FFh
SMT2WIN_WSEL0_POSN                       equ 0000h
SMT2WIN_WSEL0_POSITION                   equ 0000h
SMT2WIN_WSEL0_SIZE                       equ 0001h
SMT2WIN_WSEL0_LENGTH                     equ 0001h
SMT2WIN_WSEL0_MASK                       equ 0001h
SMT2WIN_WSEL1_POSN                       equ 0001h
SMT2WIN_WSEL1_POSITION                   equ 0001h
SMT2WIN_WSEL1_SIZE                       equ 0001h
SMT2WIN_WSEL1_LENGTH                     equ 0001h
SMT2WIN_WSEL1_MASK                       equ 0002h
SMT2WIN_WSEL2_POSN                       equ 0002h
SMT2WIN_WSEL2_POSITION                   equ 0002h
SMT2WIN_WSEL2_SIZE                       equ 0001h
SMT2WIN_WSEL2_LENGTH                     equ 0001h
SMT2WIN_WSEL2_MASK                       equ 0004h
SMT2WIN_WSEL3_POSN                       equ 0003h
SMT2WIN_WSEL3_POSITION                   equ 0003h
SMT2WIN_WSEL3_SIZE                       equ 0001h
SMT2WIN_WSEL3_LENGTH                     equ 0001h
SMT2WIN_WSEL3_MASK                       equ 0008h
SMT2WIN_WSEL4_POSN                       equ 0004h
SMT2WIN_WSEL4_POSITION                   equ 0004h
SMT2WIN_WSEL4_SIZE                       equ 0001h
SMT2WIN_WSEL4_LENGTH                     equ 0001h
SMT2WIN_WSEL4_MASK                       equ 0010h
SMT2WIN_SMT2WSEL_POSN                    equ 0000h
SMT2WIN_SMT2WSEL_POSITION                equ 0000h
SMT2WIN_SMT2WSEL_SIZE                    equ 0008h
SMT2WIN_SMT2WSEL_LENGTH                  equ 0008h
SMT2WIN_SMT2WSEL_MASK                    equ 00FFh
SMT2WIN_SMT2WSEL0_POSN                   equ 0000h
SMT2WIN_SMT2WSEL0_POSITION               equ 0000h
SMT2WIN_SMT2WSEL0_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL0_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL0_MASK                   equ 0001h
SMT2WIN_SMT2WSEL1_POSN                   equ 0001h
SMT2WIN_SMT2WSEL1_POSITION               equ 0001h
SMT2WIN_SMT2WSEL1_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL1_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL1_MASK                   equ 0002h
SMT2WIN_SMT2WSEL2_POSN                   equ 0002h
SMT2WIN_SMT2WSEL2_POSITION               equ 0002h
SMT2WIN_SMT2WSEL2_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL2_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL2_MASK                   equ 0004h
SMT2WIN_SMT2WSEL3_POSN                   equ 0003h
SMT2WIN_SMT2WSEL3_POSITION               equ 0003h
SMT2WIN_SMT2WSEL3_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL3_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL3_MASK                   equ 0008h
SMT2WIN_SMT2WSEL4_POSN                   equ 0004h
SMT2WIN_SMT2WSEL4_POSITION               equ 0004h
SMT2WIN_SMT2WSEL4_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL4_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL4_MASK                   equ 0010h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E0Fh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 0E10h
// bitfield definitions
INTPPS_INTPPS0_POSN                      equ 0000h
INTPPS_INTPPS0_POSITION                  equ 0000h
INTPPS_INTPPS0_SIZE                      equ 0001h
INTPPS_INTPPS0_LENGTH                    equ 0001h
INTPPS_INTPPS0_MASK                      equ 0001h
INTPPS_INTPPS1_POSN                      equ 0001h
INTPPS_INTPPS1_POSITION                  equ 0001h
INTPPS_INTPPS1_SIZE                      equ 0001h
INTPPS_INTPPS1_LENGTH                    equ 0001h
INTPPS_INTPPS1_MASK                      equ 0002h
INTPPS_INTPPS2_POSN                      equ 0002h
INTPPS_INTPPS2_POSITION                  equ 0002h
INTPPS_INTPPS2_SIZE                      equ 0001h
INTPPS_INTPPS2_LENGTH                    equ 0001h
INTPPS_INTPPS2_MASK                      equ 0004h
INTPPS_INTPPS3_POSN                      equ 0003h
INTPPS_INTPPS3_POSITION                  equ 0003h
INTPPS_INTPPS3_SIZE                      equ 0001h
INTPPS_INTPPS3_LENGTH                    equ 0001h
INTPPS_INTPPS3_MASK                      equ 0008h
INTPPS_INTPPS4_POSN                      equ 0004h
INTPPS_INTPPS4_POSITION                  equ 0004h
INTPPS_INTPPS4_SIZE                      equ 0001h
INTPPS_INTPPS4_LENGTH                    equ 0001h
INTPPS_INTPPS4_MASK                      equ 0010h

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E11h
// bitfield definitions
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS4_POSN                  equ 0004h
T0CKIPPS_T0CKIPPS4_POSITION              equ 0004h
T0CKIPPS_T0CKIPPS4_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS4_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS4_MASK                  equ 0010h

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0E12h
// bitfield definitions
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0E13h
// bitfield definitions
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0E14h
// bitfield definitions
CCP1PPS_CCP1PPS0_POSN                    equ 0000h
CCP1PPS_CCP1PPS0_POSITION                equ 0000h
CCP1PPS_CCP1PPS0_SIZE                    equ 0001h
CCP1PPS_CCP1PPS0_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS0_MASK                    equ 0001h
CCP1PPS_CCP1PPS1_POSN                    equ 0001h
CCP1PPS_CCP1PPS1_POSITION                equ 0001h
CCP1PPS_CCP1PPS1_SIZE                    equ 0001h
CCP1PPS_CCP1PPS1_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS1_MASK                    equ 0002h
CCP1PPS_CCP1PPS2_POSN                    equ 0002h
CCP1PPS_CCP1PPS2_POSITION                equ 0002h
CCP1PPS_CCP1PPS2_SIZE                    equ 0001h
CCP1PPS_CCP1PPS2_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS2_MASK                    equ 0004h
CCP1PPS_CCP1PPS3_POSN                    equ 0003h
CCP1PPS_CCP1PPS3_POSITION                equ 0003h
CCP1PPS_CCP1PPS3_SIZE                    equ 0001h
CCP1PPS_CCP1PPS3_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS3_MASK                    equ 0008h
CCP1PPS_CCP1PPS4_POSN                    equ 0004h
CCP1PPS_CCP1PPS4_POSITION                equ 0004h
CCP1PPS_CCP1PPS4_SIZE                    equ 0001h
CCP1PPS_CCP1PPS4_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS4_MASK                    equ 0010h

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0E15h
// bitfield definitions
CCP2PPS_CCP2PPS0_POSN                    equ 0000h
CCP2PPS_CCP2PPS0_POSITION                equ 0000h
CCP2PPS_CCP2PPS0_SIZE                    equ 0001h
CCP2PPS_CCP2PPS0_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS0_MASK                    equ 0001h
CCP2PPS_CCP2PPS1_POSN                    equ 0001h
CCP2PPS_CCP2PPS1_POSITION                equ 0001h
CCP2PPS_CCP2PPS1_SIZE                    equ 0001h
CCP2PPS_CCP2PPS1_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS1_MASK                    equ 0002h
CCP2PPS_CCP2PPS2_POSN                    equ 0002h
CCP2PPS_CCP2PPS2_POSITION                equ 0002h
CCP2PPS_CCP2PPS2_SIZE                    equ 0001h
CCP2PPS_CCP2PPS2_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS2_MASK                    equ 0004h
CCP2PPS_CCP2PPS3_POSN                    equ 0003h
CCP2PPS_CCP2PPS3_POSITION                equ 0003h
CCP2PPS_CCP2PPS3_SIZE                    equ 0001h
CCP2PPS_CCP2PPS3_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS3_MASK                    equ 0008h
CCP2PPS_CCP2PPS4_POSN                    equ 0004h
CCP2PPS_CCP2PPS4_POSITION                equ 0004h
CCP2PPS_CCP2PPS4_SIZE                    equ 0001h
CCP2PPS_CCP2PPS4_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS4_MASK                    equ 0010h

