GopalSaraf/Practicals/PSDL/include/proc/pic16f1618.inc
#define PHS3                             BANKMASK(AT1PHSL), 3
#define PHS4                             BANKMASK(AT1PHSL), 4
#define PHS5                             BANKMASK(AT1PHSL), 5
#define PHS6                             BANKMASK(AT1PHSL), 6
#define PHS7                             BANKMASK(AT1PHSL), 7
#define PHS8                             BANKMASK(AT1PHSH), 0
#define PHS9                             BANKMASK(AT1PHSH), 1
#define PHSL8                            BANKMASK(AT1PHSH), 0
#define PHSL9                            BANKMASK(AT1PHSH), 1
#define PID1ACC0                         BANKMASK(PID1ACCLL), 0
#define PID1ACC1                         BANKMASK(PID1ACCLL), 1
#define PID1ACC10                        BANKMASK(PID1ACCLH), 2
#define PID1ACC11                        BANKMASK(PID1ACCLH), 3
#define PID1ACC12                        BANKMASK(PID1ACCLH), 4
#define PID1ACC13                        BANKMASK(PID1ACCLH), 5
#define PID1ACC14                        BANKMASK(PID1ACCLH), 6
#define PID1ACC15                        BANKMASK(PID1ACCLH), 7
#define PID1ACC16                        BANKMASK(PID1ACCHL), 0
#define PID1ACC17                        BANKMASK(PID1ACCHL), 1
#define PID1ACC18                        BANKMASK(PID1ACCHL), 2
#define PID1ACC19                        BANKMASK(PID1ACCHL), 3
#define PID1ACC2                         BANKMASK(PID1ACCLL), 2
#define PID1ACC20                        BANKMASK(PID1ACCHL), 4
#define PID1ACC21                        BANKMASK(PID1ACCHL), 5
#define PID1ACC22                        BANKMASK(PID1ACCHL), 6
#define PID1ACC23                        BANKMASK(PID1ACCHL), 7
#define PID1ACC24                        BANKMASK(PID1ACCHH), 0
#define PID1ACC25                        BANKMASK(PID1ACCHH), 1
#define PID1ACC26                        BANKMASK(PID1ACCHH), 2
#define PID1ACC27                        BANKMASK(PID1ACCHH), 3
#define PID1ACC28                        BANKMASK(PID1ACCHH), 4
#define PID1ACC29                        BANKMASK(PID1ACCHH), 5
#define PID1ACC3                         BANKMASK(PID1ACCLL), 3
#define PID1ACC30                        BANKMASK(PID1ACCHH), 6
#define PID1ACC31                        BANKMASK(PID1ACCHH), 7
#define PID1ACC32                        BANKMASK(PID1ACCU), 0
#define PID1ACC33                        BANKMASK(PID1ACCU), 1
#define PID1ACC34                        BANKMASK(PID1ACCU), 2
#define PID1ACC4                         BANKMASK(PID1ACCLL), 4
#define PID1ACC5                         BANKMASK(PID1ACCLL), 5
#define PID1ACC6                         BANKMASK(PID1ACCLL), 6
#define PID1ACC7                         BANKMASK(PID1ACCLL), 7
#define PID1ACC8                         BANKMASK(PID1ACCLH), 0
#define PID1ACC9                         BANKMASK(PID1ACCLH), 1
#define PID1BUSY                         BANKMASK(PID1CON), 6
#define PID1DIE                          BANKMASK(PIE5), 0
#define PID1DIF                          BANKMASK(PIR5), 0
#define PID1EIE                          BANKMASK(PIE5), 1
#define PID1EIF                          BANKMASK(PIR5), 1
#define PID1EN                           BANKMASK(PID1CON), 7
#define PID1IN0                          BANKMASK(PID1INL), 0
#define PID1IN1                          BANKMASK(PID1INL), 1
#define PID1IN10                         BANKMASK(PID1INH), 2
#define PID1IN11                         BANKMASK(PID1INH), 3
#define PID1IN12                         BANKMASK(PID1INH), 4
#define PID1IN13                         BANKMASK(PID1INH), 5
#define PID1IN14                         BANKMASK(PID1INH), 6
#define PID1IN15                         BANKMASK(PID1INH), 7
#define PID1IN2                          BANKMASK(PID1INL), 2
#define PID1IN3                          BANKMASK(PID1INL), 3
#define PID1IN4                          BANKMASK(PID1INL), 4
#define PID1IN5                          BANKMASK(PID1INL), 5
#define PID1IN6                          BANKMASK(PID1INL), 6
#define PID1IN7                          BANKMASK(PID1INL), 7
#define PID1IN8                          BANKMASK(PID1INH), 0
#define PID1IN9                          BANKMASK(PID1INH), 1
#define PID1K10                          BANKMASK(PID1K1L), 0
#define PID1K11                          BANKMASK(PID1K1L), 1
#define PID1K110                         BANKMASK(PID1K1H), 2
#define PID1K111                         BANKMASK(PID1K1H), 3
#define PID1K112                         BANKMASK(PID1K1H), 4
#define PID1K113                         BANKMASK(PID1K1H), 5
#define PID1K114                         BANKMASK(PID1K1H), 6
#define PID1K115                         BANKMASK(PID1K1H), 7
#define PID1K12                          BANKMASK(PID1K1L), 2
#define PID1K13                          BANKMASK(PID1K1L), 3
#define PID1K14                          BANKMASK(PID1K1L), 4
#define PID1K15                          BANKMASK(PID1K1L), 5
#define PID1K16                          BANKMASK(PID1K1L), 6
#define PID1K17                          BANKMASK(PID1K1L), 7
#define PID1K18                          BANKMASK(PID1K1H), 0
#define PID1K19                          BANKMASK(PID1K1H), 1
#define PID1K20                          BANKMASK(PID1K2L), 0
#define PID1K21                          BANKMASK(PID1K2L), 1
#define PID1K210                         BANKMASK(PID1K2H), 2
#define PID1K211                         BANKMASK(PID1K2H), 3
#define PID1K212                         BANKMASK(PID1K2H), 4
#define PID1K213                         BANKMASK(PID1K2H), 5
#define PID1K214                         BANKMASK(PID1K2H), 6
#define PID1K215                         BANKMASK(PID1K2H), 7
#define PID1K22                          BANKMASK(PID1K2L), 2
#define PID1K23                          BANKMASK(PID1K2L), 3
#define PID1K24                          BANKMASK(PID1K2L), 4
#define PID1K25                          BANKMASK(PID1K2L), 5
#define PID1K26                          BANKMASK(PID1K2L), 6
#define PID1K27                          BANKMASK(PID1K2L), 7
#define PID1K28                          BANKMASK(PID1K2H), 0
#define PID1K29                          BANKMASK(PID1K2H), 1
#define PID1K30                          BANKMASK(PID1K3L), 0
#define PID1K31                          BANKMASK(PID1K3L), 1
#define PID1K310                         BANKMASK(PID1K3H), 2
#define PID1K311                         BANKMASK(PID1K3H), 3
#define PID1K312                         BANKMASK(PID1K3H), 4
#define PID1K313                         BANKMASK(PID1K3H), 5
#define PID1K314                         BANKMASK(PID1K3H), 6
#define PID1K315                         BANKMASK(PID1K3H), 7
#define PID1K32                          BANKMASK(PID1K3L), 2
#define PID1K33                          BANKMASK(PID1K3L), 3
#define PID1K34                          BANKMASK(PID1K3L), 4
#define PID1K35                          BANKMASK(PID1K3L), 5
#define PID1K36                          BANKMASK(PID1K3L), 6
#define PID1K37                          BANKMASK(PID1K3L), 7
#define PID1K38                          BANKMASK(PID1K3H), 0
#define PID1K39                          BANKMASK(PID1K3H), 1
#define PID1MODE0                        BANKMASK(PID1CON), 0
#define PID1MODE1                        BANKMASK(PID1CON), 1
#define PID1MODE2                        BANKMASK(PID1CON), 2
#define PID1OUT0                         BANKMASK(PID1OUTLL), 0
#define PID1OUT1                         BANKMASK(PID1OUTLL), 1
#define PID1OUT10                        BANKMASK(PID1OUTLH), 2
#define PID1OUT11                        BANKMASK(PID1OUTLH), 3
#define PID1OUT12                        BANKMASK(PID1OUTLH), 4
#define PID1OUT13                        BANKMASK(PID1OUTLH), 5
#define PID1OUT14                        BANKMASK(PID1OUTLH), 6
#define PID1OUT15                        BANKMASK(PID1OUTLH), 7
#define PID1OUT16                        BANKMASK(PID1OUTHL), 0
#define PID1OUT17                        BANKMASK(PID1OUTHL), 1
#define PID1OUT18                        BANKMASK(PID1OUTHL), 2
#define PID1OUT19                        BANKMASK(PID1OUTHL), 3
#define PID1OUT2                         BANKMASK(PID1OUTLL), 2
#define PID1OUT20                        BANKMASK(PID1OUTHL), 4
#define PID1OUT21                        BANKMASK(PID1OUTHL), 5
#define PID1OUT22                        BANKMASK(PID1OUTHL), 6
#define PID1OUT23                        BANKMASK(PID1OUTHL), 7
#define PID1OUT24                        BANKMASK(PID1OUTHH), 0
#define PID1OUT25                        BANKMASK(PID1OUTHH), 1
#define PID1OUT26                        BANKMASK(PID1OUTHH), 2
#define PID1OUT27                        BANKMASK(PID1OUTHH), 3
#define PID1OUT28                        BANKMASK(PID1OUTHH), 4
#define PID1OUT29                        BANKMASK(PID1OUTHH), 5
#define PID1OUT3                         BANKMASK(PID1OUTLL), 3
#define PID1OUT30                        BANKMASK(PID1OUTHH), 6
#define PID1OUT31                        BANKMASK(PID1OUTHH), 7
#define PID1OUT32                        BANKMASK(PID1OUTU), 0
#define PID1OUT33                        BANKMASK(PID1OUTU), 1
#define PID1OUT34                        BANKMASK(PID1OUTU), 2
#define PID1OUT35                        BANKMASK(PID1OUTU), 3
#define PID1OUT4                         BANKMASK(PID1OUTLL), 4
#define PID1OUT5                         BANKMASK(PID1OUTLL), 5
#define PID1OUT6                         BANKMASK(PID1OUTLL), 6
#define PID1OUT7                         BANKMASK(PID1OUTLL), 7
#define PID1OUT8                         BANKMASK(PID1OUTLH), 0
#define PID1OUT9                         BANKMASK(PID1OUTLH), 1
#define PID1SET0                         BANKMASK(PID1SETL), 0
#define PID1SET1                         BANKMASK(PID1SETL), 1
#define PID1SET10                        BANKMASK(PID1SETH), 2
#define PID1SET11                        BANKMASK(PID1SETH), 3
#define PID1SET12                        BANKMASK(PID1SETH), 4
#define PID1SET13                        BANKMASK(PID1SETH), 5
#define PID1SET14                        BANKMASK(PID1SETH), 6
#define PID1SET15                        BANKMASK(PID1SETH), 7
#define PID1SET2                         BANKMASK(PID1SETL), 2
#define PID1SET3                         BANKMASK(PID1SETL), 3
#define PID1SET4                         BANKMASK(PID1SETL), 4
#define PID1SET5                         BANKMASK(PID1SETL), 5
#define PID1SET6                         BANKMASK(PID1SETL), 6
#define PID1SET7                         BANKMASK(PID1SETL), 7
#define PID1SET8                         BANKMASK(PID1SETH), 0
#define PID1SET9                         BANKMASK(PID1SETH), 1
#define PID1Z10                          BANKMASK(PID1Z1L), 0
#define PID1Z11                          BANKMASK(PID1Z1L), 1
#define PID1Z110                         BANKMASK(PID1Z1H), 2
#define PID1Z111                         BANKMASK(PID1Z1H), 3
#define PID1Z112                         BANKMASK(PID1Z1H), 4
#define PID1Z113                         BANKMASK(PID1Z1H), 5
#define PID1Z114                         BANKMASK(PID1Z1H), 6
#define PID1Z115                         BANKMASK(PID1Z1H), 7
#define PID1Z116                         BANKMASK(PID1Z1U), 0
#define PID1Z12                          BANKMASK(PID1Z1L), 2
#define PID1Z13                          BANKMASK(PID1Z1L), 3
#define PID1Z14                          BANKMASK(PID1Z1L), 4
#define PID1Z15                          BANKMASK(PID1Z1L), 5
#define PID1Z16                          BANKMASK(PID1Z1L), 6
#define PID1Z17                          BANKMASK(PID1Z1L), 7
#define PID1Z18                          BANKMASK(PID1Z1H), 0
#define PID1Z19                          BANKMASK(PID1Z1H), 1
#define PID1Z20                          BANKMASK(PID1Z2L), 0
#define PID1Z21                          BANKMASK(PID1Z2L), 1
#define PID1Z210                         BANKMASK(PID1Z2H), 2
#define PID1Z211                         BANKMASK(PID1Z2H), 3
#define PID1Z212                         BANKMASK(PID1Z2H), 4
#define PID1Z213                         BANKMASK(PID1Z2H), 5
#define PID1Z214                         BANKMASK(PID1Z2H), 6
#define PID1Z215                         BANKMASK(PID1Z2H), 7
#define PID1Z216                         BANKMASK(PID1Z2U), 0
#define PID1Z22                          BANKMASK(PID1Z2L), 2
#define PID1Z23                          BANKMASK(PID1Z2L), 3
#define PID1Z24                          BANKMASK(PID1Z2L), 4
#define PID1Z25                          BANKMASK(PID1Z2L), 5
#define PID1Z26                          BANKMASK(PID1Z2L), 6
#define PID1Z27                          BANKMASK(PID1Z2L), 7
#define PID1Z28                          BANKMASK(PID1Z2H), 0
#define PID1Z29                          BANKMASK(PID1Z2H), 1
#define PLEN0                            BANKMASK(CRCCON1), 0
#define PLEN1                            BANKMASK(CRCCON1), 1
#define PLEN2                            BANKMASK(CRCCON1), 2
#define PLEN3                            BANKMASK(CRCCON1), 3
#define PLLR                             BANKMASK(OSCSTAT), 6
#define POLA                             BANKMASK(CWG1CON1), 0
#define POLB                             BANKMASK(CWG1CON1), 1
#define POLC                             BANKMASK(CWG1CON1), 2
#define POLD                             BANKMASK(CWG1CON1), 3
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PREC                             BANKMASK(AT1CON0), 6
#define PRP                              BANKMASK(AT1CON1), 4
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSCNT0                           BANKMASK(WDTPSL), 0
#define PSCNT1                           BANKMASK(WDTPSL), 1
#define PSCNT10                          BANKMASK(WDTPSH), 2
#define PSCNT11                          BANKMASK(WDTPSH), 3
#define PSCNT12                          BANKMASK(WDTPSH), 4
#define PSCNT13                          BANKMASK(WDTPSH), 5
#define PSCNT14                          BANKMASK(WDTPSH), 6
#define PSCNT15                          BANKMASK(WDTPSH), 7
#define PSCNT16                          BANKMASK(WDTTMR), 0
#define PSCNT17                          BANKMASK(WDTTMR), 1
#define PSCNT2                           BANKMASK(WDTPSL), 2
#define PSCNT3                           BANKMASK(WDTPSL), 3
#define PSCNT4                           BANKMASK(WDTPSL), 4
#define PSCNT5                           BANKMASK(WDTPSL), 5
#define PSCNT6                           BANKMASK(WDTPSL), 6
#define PSCNT7                           BANKMASK(WDTPSL), 7
#define PSCNT8                           BANKMASK(WDTPSH), 0
#define PSCNT9                           BANKMASK(WDTPSH), 1
#define PWM3DC0                          BANKMASK(PWM3DCL), 6
#define PWM3DC1                          BANKMASK(PWM3DCL), 7
#define PWM3DC2                          BANKMASK(PWM3DCH), 0
#define PWM3DC3                          BANKMASK(PWM3DCH), 1
#define PWM3DC4                          BANKMASK(PWM3DCH), 2
#define PWM3DC5                          BANKMASK(PWM3DCH), 3
#define PWM3DC6                          BANKMASK(PWM3DCH), 4
#define PWM3DC7                          BANKMASK(PWM3DCH), 5
#define PWM3DC8                          BANKMASK(PWM3DCH), 6
#define PWM3DC9                          BANKMASK(PWM3DCH), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM4DC0                          BANKMASK(PWM4DCL), 6
#define PWM4DC1                          BANKMASK(PWM4DCL), 7
#define PWM4DC2                          BANKMASK(PWM4DCH), 0
#define PWM4DC3                          BANKMASK(PWM4DCH), 1
#define PWM4DC4                          BANKMASK(PWM4DCH), 2
#define PWM4DC5                          BANKMASK(PWM4DCH), 3
#define PWM4DC6                          BANKMASK(PWM4DCH), 4
#define PWM4DC7                          BANKMASK(PWM4DCH), 5
#define PWM4DC8                          BANKMASK(PWM4DCH), 6
#define PWM4DC9                          BANKMASK(PWM4DCH), 7
#define PWM4EN                           BANKMASK(PWM4CON), 7
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define RA0                              BANKMASK(PORTA), 0
#define RA0PPS0                          BANKMASK(RA0PPS), 0
#define RA0PPS1                          BANKMASK(RA0PPS), 1
#define RA0PPS2                          BANKMASK(RA0PPS), 2
#define RA0PPS3                          BANKMASK(RA0PPS), 3
#define RA0PPS4                          BANKMASK(RA0PPS), 4
#define RA1                              BANKMASK(PORTA), 1
#define RA1PPS0                          BANKMASK(RA1PPS), 0
#define RA1PPS1                          BANKMASK(RA1PPS), 1
#define RA1PPS2                          BANKMASK(RA1PPS), 2
#define RA1PPS3                          BANKMASK(RA1PPS), 3
#define RA1PPS4                          BANKMASK(RA1PPS), 4
#define RA2                              BANKMASK(PORTA), 2
#define RA2PPS0                          BANKMASK(RA2PPS), 0
#define RA2PPS1                          BANKMASK(RA2PPS), 1
#define RA2PPS2                          BANKMASK(RA2PPS), 2
#define RA2PPS3                          BANKMASK(RA2PPS), 3
#define RA2PPS4                          BANKMASK(RA2PPS), 4
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA4PPS0                          BANKMASK(RA4PPS), 0
#define RA4PPS1                          BANKMASK(RA4PPS), 1
#define RA4PPS2                          BANKMASK(RA4PPS), 2
#define RA4PPS3                          BANKMASK(RA4PPS), 3
#define RA4PPS4                          BANKMASK(RA4PPS), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA5PPS0                          BANKMASK(RA5PPS), 0
#define RA5PPS1                          BANKMASK(RA5PPS), 1
#define RA5PPS2                          BANKMASK(RA5PPS), 2
#define RA5PPS3                          BANKMASK(RA5PPS), 3
#define RA5PPS4                          BANKMASK(RA5PPS), 4
#define RB4                              BANKMASK(PORTB), 4
#define RB4PPS0                          BANKMASK(RB4PPS), 0
#define RB4PPS1                          BANKMASK(RB4PPS), 1
#define RB4PPS2                          BANKMASK(RB4PPS), 2
#define RB4PPS3                          BANKMASK(RB4PPS), 3
#define RB4PPS4                          BANKMASK(RB4PPS), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB5PPS0                          BANKMASK(RB5PPS), 0
#define RB5PPS1                          BANKMASK(RB5PPS), 1
#define RB5PPS2                          BANKMASK(RB5PPS), 2
#define RB5PPS3                          BANKMASK(RB5PPS), 3
#define RB5PPS4                          BANKMASK(RB5PPS), 4
#define RB6                              BANKMASK(PORTB), 6
#define RB6PPS0                          BANKMASK(RB6PPS), 0
#define RB6PPS1                          BANKMASK(RB6PPS), 1
#define RB6PPS2                          BANKMASK(RB6PPS), 2
#define RB6PPS3                          BANKMASK(RB6PPS), 3
#define RB6PPS4                          BANKMASK(RB6PPS), 4
#define RB7                              BANKMASK(PORTB), 7
#define RB7PPS0                          BANKMASK(RB7PPS), 0
#define RB7PPS1                          BANKMASK(RB7PPS), 1
#define RB7PPS2                          BANKMASK(RB7PPS), 2
#define RB7PPS3                          BANKMASK(RB7PPS), 3
#define RB7PPS4                          BANKMASK(RB7PPS), 4
#define RC0                              BANKMASK(PORTC), 0
#define RC0PPS0                          BANKMASK(RC0PPS), 0
#define RC0PPS1                          BANKMASK(RC0PPS), 1
#define RC0PPS2                          BANKMASK(RC0PPS), 2
#define RC0PPS3                          BANKMASK(RC0PPS), 3
#define RC0PPS4                          BANKMASK(RC0PPS), 4
#define RC1                              BANKMASK(PORTC), 1
#define RC1PPS0                          BANKMASK(RC1PPS), 0
#define RC1PPS1                          BANKMASK(RC1PPS), 1
#define RC1PPS2                          BANKMASK(RC1PPS), 2
#define RC1PPS3                          BANKMASK(RC1PPS), 3
#define RC1PPS4                          BANKMASK(RC1PPS), 4
#define RC2                              BANKMASK(PORTC), 2
#define RC2PPS0                          BANKMASK(RC2PPS), 0
#define RC2PPS1                          BANKMASK(RC2PPS), 1
#define RC2PPS2                          BANKMASK(RC2PPS), 2
#define RC2PPS3                          BANKMASK(RC2PPS), 3
#define RC2PPS4                          BANKMASK(RC2PPS), 4
#define RC3                              BANKMASK(PORTC), 3
#define RC3PPS0                          BANKMASK(RC3PPS), 0
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC5PPS0                          BANKMASK(RC5PPS), 0
#define RC5PPS1                          BANKMASK(RC5PPS), 1
#define RC5PPS2                          BANKMASK(RC5PPS), 2
#define RC5PPS3                          BANKMASK(RC5PPS), 3
#define RC5PPS4                          BANKMASK(RC5PPS), 4
#define RC6                              BANKMASK(PORTC), 6
#define RC6PPS0                          BANKMASK(RC6PPS), 0
#define RC6PPS1                          BANKMASK(RC6PPS), 1
#define RC6PPS2                          BANKMASK(RC6PPS), 2
#define RC6PPS3                          BANKMASK(RC6PPS), 3
#define RC6PPS4                          BANKMASK(RC6PPS), 4
#define RC7                              BANKMASK(PORTC), 7
#define RC7PPS0                          BANKMASK(RC7PPS), 0
#define RC7PPS1                          BANKMASK(RC7PPS), 1
#define RC7PPS2                          BANKMASK(RC7PPS), 2
#define RC7PPS3                          BANKMASK(RC7PPS), 3
#define RC7PPS4                          BANKMASK(RC7PPS), 4
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(PMCON1), 0
#define REN                              BANKMASK(CWG1AS0), 6
#define RES0                             BANKMASK(AT1RESL), 0
#define RES1                             BANKMASK(AT1RESL), 1
#define RES2                             BANKMASK(AT1RESL), 2
#define RES3                             BANKMASK(AT1RESL), 3
#define RES4                             BANKMASK(AT1RESL), 4
#define RES5                             BANKMASK(AT1RESL), 5
#define RES6                             BANKMASK(AT1RESL), 6
#define RES7                             BANKMASK(AT1RESL), 7
#define RES8                             BANKMASK(AT1RESH), 0
#define RES9                             BANKMASK(AT1RESH), 1
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define RXPPS0                           BANKMASK(RXPPS), 0
#define RXPPS1                           BANKMASK(RXPPS), 1
#define RXPPS2                           BANKMASK(RXPPS), 2
#define RXPPS3                           BANKMASK(RXPPS), 3
