GopalSaraf/Practicals/PSDL/include/proc/pic16f1618.inc
#define RXPPS4                           BANKMASK(RXPPS), 4
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCANBUSY                         BANKMASK(SCANCON0), 5
#define SCANEN                           BANKMASK(SCANCON0), 7
#define SCANGO                           BANKMASK(SCANCON0), 6
#define SCANHADR0                        BANKMASK(SCANHADRL), 0
#define SCANHADR1                        BANKMASK(SCANHADRL), 1
#define SCANHADR10                       BANKMASK(SCANHADRH), 2
#define SCANHADR11                       BANKMASK(SCANHADRH), 3
#define SCANHADR12                       BANKMASK(SCANHADRH), 4
#define SCANHADR13                       BANKMASK(SCANHADRH), 5
#define SCANHADR14                       BANKMASK(SCANHADRH), 6
#define SCANHADR15                       BANKMASK(SCANHADRH), 7
#define SCANHADR2                        BANKMASK(SCANHADRL), 2
#define SCANHADR3                        BANKMASK(SCANHADRL), 3
#define SCANHADR4                        BANKMASK(SCANHADRL), 4
#define SCANHADR5                        BANKMASK(SCANHADRL), 5
#define SCANHADR6                        BANKMASK(SCANHADRL), 6
#define SCANHADR7                        BANKMASK(SCANHADRL), 7
#define SCANHADR8                        BANKMASK(SCANHADRH), 0
#define SCANHADR9                        BANKMASK(SCANHADRH), 1
#define SCANIE                           BANKMASK(PIE4), 7
#define SCANIF                           BANKMASK(PIR4), 7
#define SCANINTM                         BANKMASK(SCANCON0), 3
#define SCANINVALID                      BANKMASK(SCANCON0), 4
#define SCANLADR0                        BANKMASK(SCANLADRL), 0
#define SCANLADR1                        BANKMASK(SCANLADRL), 1
#define SCANLADR10                       BANKMASK(SCANLADRH), 2
#define SCANLADR11                       BANKMASK(SCANLADRH), 3
#define SCANLADR12                       BANKMASK(SCANLADRH), 4
#define SCANLADR13                       BANKMASK(SCANLADRH), 5
#define SCANLADR14                       BANKMASK(SCANLADRH), 6
#define SCANLADR15                       BANKMASK(SCANLADRH), 7
#define SCANLADR2                        BANKMASK(SCANLADRL), 2
#define SCANLADR3                        BANKMASK(SCANLADRL), 3
#define SCANLADR4                        BANKMASK(SCANLADRL), 4
#define SCANLADR5                        BANKMASK(SCANLADRL), 5
#define SCANLADR6                        BANKMASK(SCANLADRL), 6
#define SCANLADR7                        BANKMASK(SCANLADRL), 7
#define SCANLADR8                        BANKMASK(SCANLADRH), 0
#define SCANLADR9                        BANKMASK(SCANLADRH), 1
#define SCANMODE0                        BANKMASK(SCANCON0), 0
#define SCANMODE1                        BANKMASK(SCANCON0), 1
#define SCANTSEL0                        BANKMASK(SCANTRIG), 0
#define SCANTSEL1                        BANKMASK(SCANTRIG), 1
#define SCANTSEL2                        BANKMASK(SCANTRIG), 2
#define SCANTSEL3                        BANKMASK(SCANTRIG), 3
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SENDB                            BANKMASK(TX1STA), 3
#define SET0                             BANKMASK(PID1SETL), 0
#define SET1                             BANKMASK(PID1SETL), 1
#define SET10                            BANKMASK(PID1SETH), 2
#define SET11                            BANKMASK(PID1SETH), 3
#define SET12                            BANKMASK(PID1SETH), 4
#define SET13                            BANKMASK(PID1SETH), 5
#define SET14                            BANKMASK(PID1SETH), 6
#define SET15                            BANKMASK(PID1SETH), 7
#define SET2                             BANKMASK(PID1SETL), 2
#define SET3                             BANKMASK(PID1SETL), 3
#define SET4                             BANKMASK(PID1SETL), 4
#define SET5                             BANKMASK(PID1SETL), 5
#define SET6                             BANKMASK(PID1SETL), 6
#define SET7                             BANKMASK(PID1SETL), 7
#define SET8                             BANKMASK(PID1SETH), 0
#define SET9                             BANKMASK(PID1SETH), 1
#define SHIFT0                           BANKMASK(CRCSHIFTL), 0
#define SHIFT1                           BANKMASK(CRCSHIFTL), 1
#define SHIFT10                          BANKMASK(CRCSHIFTH), 2
#define SHIFT11                          BANKMASK(CRCSHIFTH), 3
#define SHIFT12                          BANKMASK(CRCSHIFTH), 4
#define SHIFT13                          BANKMASK(CRCSHIFTH), 5
#define SHIFT14                          BANKMASK(CRCSHIFTH), 6
#define SHIFT15                          BANKMASK(CRCSHIFTH), 7
#define SHIFT2                           BANKMASK(CRCSHIFTL), 2
#define SHIFT3                           BANKMASK(CRCSHIFTL), 3
#define SHIFT4                           BANKMASK(CRCSHIFTL), 4
#define SHIFT5                           BANKMASK(CRCSHIFTL), 5
#define SHIFT6                           BANKMASK(CRCSHIFTL), 6
#define SHIFT7                           BANKMASK(CRCSHIFTL), 7
#define SHIFT8                           BANKMASK(CRCSHIFTH), 0
#define SHIFT9                           BANKMASK(CRCSHIFTH), 1
#define SHIFTM                           BANKMASK(CRCCON0), 1
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SMP                              BANKMASK(SSP1STAT), 7
#define SMT1AS                           BANKMASK(SMT1STAT), 0
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2
#define SMT1GO                           BANKMASK(SMT1CON1), 7
#define SMT1IE                           BANKMASK(PIE4), 0
#define SMT1IF                           BANKMASK(PIR4), 0
#define SMT1MODE0                        BANKMASK(SMT1CON1), 0
#define SMT1MODE1                        BANKMASK(SMT1CON1), 1
#define SMT1MODE2                        BANKMASK(SMT1CON1), 2
#define SMT1MODE3                        BANKMASK(SMT1CON1), 3
#define SMT1PR0                          BANKMASK(SMT1PRL), 0
#define SMT1PR1                          BANKMASK(SMT1PRL), 1
#define SMT1PR10                         BANKMASK(SMT1PRH), 2
#define SMT1PR11                         BANKMASK(SMT1PRH), 3
#define SMT1PR12                         BANKMASK(SMT1PRH), 4
#define SMT1PR13                         BANKMASK(SMT1PRH), 5
#define SMT1PR14                         BANKMASK(SMT1PRH), 6
#define SMT1PR15                         BANKMASK(SMT1PRH), 7
#define SMT1PR16                         BANKMASK(SMT1PRU), 0
#define SMT1PR17                         BANKMASK(SMT1PRU), 1
#define SMT1PR18                         BANKMASK(SMT1PRU), 2
#define SMT1PR19                         BANKMASK(SMT1PRU), 3
#define SMT1PR2                          BANKMASK(SMT1PRL), 2
#define SMT1PR20                         BANKMASK(SMT1PRU), 4
#define SMT1PR21                         BANKMASK(SMT1PRU), 5
#define SMT1PR22                         BANKMASK(SMT1PRU), 6
#define SMT1PR23                         BANKMASK(SMT1PRU), 7
#define SMT1PR3                          BANKMASK(SMT1PRL), 3
#define SMT1PR4                          BANKMASK(SMT1PRL), 4
#define SMT1PR5                          BANKMASK(SMT1PRL), 5
#define SMT1PR6                          BANKMASK(SMT1PRL), 6
#define SMT1PR7                          BANKMASK(SMT1PRL), 7
#define SMT1PR8                          BANKMASK(SMT1PRH), 0
#define SMT1PR9                          BANKMASK(SMT1PRH), 1
#define SMT1PRAIE                        BANKMASK(PIE4), 1
#define SMT1PRAIF                        BANKMASK(PIR4), 1
#define SMT1PS0                          BANKMASK(SMT1CON0), 0
#define SMT1PS1                          BANKMASK(SMT1CON0), 1
#define SMT1PWAIE                        BANKMASK(PIE4), 2
#define SMT1PWAIF                        BANKMASK(PIR4), 2
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6
#define SMT1RESET                        BANKMASK(SMT1STAT), 5
#define SMT1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0
#define SMT1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1
#define SMT1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2
#define SMT1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3
#define SMT1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1
#define SMT1TS                           BANKMASK(SMT1STAT), 2
#define SMT1WS                           BANKMASK(SMT1STAT), 1
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4
#define SMT2AS                           BANKMASK(SMT2STAT), 0
#define SMT2CPR0                         BANKMASK(SMT2CPRL), 0
#define SMT2CPR1                         BANKMASK(SMT2CPRL), 1
#define SMT2CPR10                        BANKMASK(SMT2CPRH), 2
#define SMT2CPR11                        BANKMASK(SMT2CPRH), 3
#define SMT2CPR12                        BANKMASK(SMT2CPRH), 4
#define SMT2CPR13                        BANKMASK(SMT2CPRH), 5
#define SMT2CPR14                        BANKMASK(SMT2CPRH), 6
#define SMT2CPR15                        BANKMASK(SMT2CPRH), 7
#define SMT2CPR16                        BANKMASK(SMT2CPRU), 0
#define SMT2CPR17                        BANKMASK(SMT2CPRU), 1
#define SMT2CPR18                        BANKMASK(SMT2CPRU), 2
#define SMT2CPR19                        BANKMASK(SMT2CPRU), 3
#define SMT2CPR2                         BANKMASK(SMT2CPRL), 2
#define SMT2CPR20                        BANKMASK(SMT2CPRU), 4
#define SMT2CPR21                        BANKMASK(SMT2CPRU), 5
#define SMT2CPR22                        BANKMASK(SMT2CPRU), 6
#define SMT2CPR23                        BANKMASK(SMT2CPRU), 7
#define SMT2CPR3                         BANKMASK(SMT2CPRL), 3
#define SMT2CPR4                         BANKMASK(SMT2CPRL), 4
#define SMT2CPR5                         BANKMASK(SMT2CPRL), 5
#define SMT2CPR6                         BANKMASK(SMT2CPRL), 6
#define SMT2CPR7                         BANKMASK(SMT2CPRL), 7
#define SMT2CPR8                         BANKMASK(SMT2CPRH), 0
#define SMT2CPR9                         BANKMASK(SMT2CPRH), 1
#define SMT2CPRUP                        BANKMASK(SMT2STAT), 7
#define SMT2CPW0                         BANKMASK(SMT2CPWL), 0
#define SMT2CPW1                         BANKMASK(SMT2CPWL), 1
#define SMT2CPW10                        BANKMASK(SMT2CPWH), 2
#define SMT2CPW11                        BANKMASK(SMT2CPWH), 3
#define SMT2CPW12                        BANKMASK(SMT2CPWH), 4
#define SMT2CPW13                        BANKMASK(SMT2CPWH), 5
#define SMT2CPW14                        BANKMASK(SMT2CPWH), 6
#define SMT2CPW15                        BANKMASK(SMT2CPWH), 7
#define SMT2CPW16                        BANKMASK(SMT2CPWU), 0
#define SMT2CPW17                        BANKMASK(SMT2CPWU), 1
#define SMT2CPW18                        BANKMASK(SMT2CPWU), 2
#define SMT2CPW19                        BANKMASK(SMT2CPWU), 3
#define SMT2CPW2                         BANKMASK(SMT2CPWL), 2
#define SMT2CPW20                        BANKMASK(SMT2CPWU), 4
#define SMT2CPW21                        BANKMASK(SMT2CPWU), 5
#define SMT2CPW22                        BANKMASK(SMT2CPWU), 6
#define SMT2CPW23                        BANKMASK(SMT2CPWU), 7
#define SMT2CPW3                         BANKMASK(SMT2CPWL), 3
#define SMT2CPW4                         BANKMASK(SMT2CPWL), 4
#define SMT2CPW5                         BANKMASK(SMT2CPWL), 5
#define SMT2CPW6                         BANKMASK(SMT2CPWL), 6
#define SMT2CPW7                         BANKMASK(SMT2CPWL), 7
#define SMT2CPW8                         BANKMASK(SMT2CPWH), 0
#define SMT2CPW9                         BANKMASK(SMT2CPWH), 1
#define SMT2CPWUP                        BANKMASK(SMT2STAT), 6
#define SMT2CSEL0                        BANKMASK(SMT2CLK), 0
#define SMT2CSEL1                        BANKMASK(SMT2CLK), 1
#define SMT2CSEL2                        BANKMASK(SMT2CLK), 2
#define SMT2GO                           BANKMASK(SMT2CON1), 7
#define SMT2IE                           BANKMASK(PIE4), 3
#define SMT2IF                           BANKMASK(PIR4), 3
#define SMT2MODE0                        BANKMASK(SMT2CON1), 0
#define SMT2MODE1                        BANKMASK(SMT2CON1), 1
#define SMT2MODE2                        BANKMASK(SMT2CON1), 2
#define SMT2MODE3                        BANKMASK(SMT2CON1), 3
#define SMT2PR0                          BANKMASK(SMT2PRL), 0
#define SMT2PR1                          BANKMASK(SMT2PRL), 1
#define SMT2PR10                         BANKMASK(SMT2PRH), 2
#define SMT2PR11                         BANKMASK(SMT2PRH), 3
#define SMT2PR12                         BANKMASK(SMT2PRH), 4
#define SMT2PR13                         BANKMASK(SMT2PRH), 5
#define SMT2PR14                         BANKMASK(SMT2PRH), 6
#define SMT2PR15                         BANKMASK(SMT2PRH), 7
#define SMT2PR16                         BANKMASK(SMT2PRU), 0
#define SMT2PR17                         BANKMASK(SMT2PRU), 1
#define SMT2PR18                         BANKMASK(SMT2PRU), 2
#define SMT2PR19                         BANKMASK(SMT2PRU), 3
#define SMT2PR2                          BANKMASK(SMT2PRL), 2
#define SMT2PR20                         BANKMASK(SMT2PRU), 4
#define SMT2PR21                         BANKMASK(SMT2PRU), 5
#define SMT2PR22                         BANKMASK(SMT2PRU), 6
#define SMT2PR23                         BANKMASK(SMT2PRU), 7
#define SMT2PR3                          BANKMASK(SMT2PRL), 3
#define SMT2PR4                          BANKMASK(SMT2PRL), 4
#define SMT2PR5                          BANKMASK(SMT2PRL), 5
#define SMT2PR6                          BANKMASK(SMT2PRL), 6
#define SMT2PR7                          BANKMASK(SMT2PRL), 7
#define SMT2PR8                          BANKMASK(SMT2PRH), 0
#define SMT2PR9                          BANKMASK(SMT2PRH), 1
#define SMT2PRAIE                        BANKMASK(PIE4), 4
#define SMT2PRAIF                        BANKMASK(PIR4), 4
#define SMT2PS0                          BANKMASK(SMT2CON0), 0
#define SMT2PS1                          BANKMASK(SMT2CON0), 1
#define SMT2PWAIE                        BANKMASK(PIE4), 5
#define SMT2PWAIF                        BANKMASK(PIR4), 5
#define SMT2REPEAT                       BANKMASK(SMT2CON1), 6
#define SMT2RESET                        BANKMASK(SMT2STAT), 5
#define SMT2SIGPPS0                      BANKMASK(SMT2SIGPPS), 0
#define SMT2SIGPPS1                      BANKMASK(SMT2SIGPPS), 1
#define SMT2SIGPPS2                      BANKMASK(SMT2SIGPPS), 2
#define SMT2SIGPPS3                      BANKMASK(SMT2SIGPPS), 3
#define SMT2SIGPPS4                      BANKMASK(SMT2SIGPPS), 4
#define SMT2SSEL0                        BANKMASK(SMT2SIG), 0
#define SMT2SSEL1                        BANKMASK(SMT2SIG), 1
#define SMT2SSEL2                        BANKMASK(SMT2SIG), 2
#define SMT2SSEL3                        BANKMASK(SMT2SIG), 3
#define SMT2SSEL4                        BANKMASK(SMT2SIG), 4
#define SMT2TMR0                         BANKMASK(SMT2TMRL), 0
#define SMT2TMR1                         BANKMASK(SMT2TMRL), 1
#define SMT2TMR10                        BANKMASK(SMT2TMRH), 2
#define SMT2TMR11                        BANKMASK(SMT2TMRH), 3
#define SMT2TMR12                        BANKMASK(SMT2TMRH), 4
#define SMT2TMR13                        BANKMASK(SMT2TMRH), 5
#define SMT2TMR14                        BANKMASK(SMT2TMRH), 6
#define SMT2TMR15                        BANKMASK(SMT2TMRH), 7
#define SMT2TMR16                        BANKMASK(SMT2TMRU), 0
#define SMT2TMR17                        BANKMASK(SMT2TMRU), 1
#define SMT2TMR18                        BANKMASK(SMT2TMRU), 2
#define SMT2TMR19                        BANKMASK(SMT2TMRU), 3
#define SMT2TMR2                         BANKMASK(SMT2TMRL), 2
#define SMT2TMR20                        BANKMASK(SMT2TMRU), 4
#define SMT2TMR21                        BANKMASK(SMT2TMRU), 5
#define SMT2TMR22                        BANKMASK(SMT2TMRU), 6
#define SMT2TMR23                        BANKMASK(SMT2TMRU), 7
#define SMT2TMR3                         BANKMASK(SMT2TMRL), 3
#define SMT2TMR4                         BANKMASK(SMT2TMRL), 4
#define SMT2TMR5                         BANKMASK(SMT2TMRL), 5
#define SMT2TMR6                         BANKMASK(SMT2TMRL), 6
#define SMT2TMR7                         BANKMASK(SMT2TMRL), 7
#define SMT2TMR8                         BANKMASK(SMT2TMRH), 0
#define SMT2TMR9                         BANKMASK(SMT2TMRH), 1
#define SMT2TS                           BANKMASK(SMT2STAT), 2
#define SMT2WINPPS0                      BANKMASK(SMT2WINPPS), 0
#define SMT2WINPPS1                      BANKMASK(SMT2WINPPS), 1
#define SMT2WINPPS2                      BANKMASK(SMT2WINPPS), 2
#define SMT2WINPPS3                      BANKMASK(SMT2WINPPS), 3
#define SMT2WINPPS4                      BANKMASK(SMT2WINPPS), 4
#define SMT2WS                           BANKMASK(SMT2STAT), 1
#define SMT2WSEL0                        BANKMASK(SMT2WIN), 0
#define SMT2WSEL1                        BANKMASK(SMT2WIN), 1
#define SMT2WSEL2                        BANKMASK(SMT2WIN), 2
#define SMT2WSEL3                        BANKMASK(SMT2WIN), 3
#define SMT2WSEL4                        BANKMASK(SMT2WIN), 4
#define SMTWINPPS0                       BANKMASK(SMT1WINPPS), 0
#define SMTWINPPS1                       BANKMASK(SMT1WINPPS), 1
